<a href="https://colab.research.google.com/github/Daivar/PANDAS-PP3/blob/main/%E2%80%9ESection_5_Merge_ipynb%E2%80%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Section 5: Merge
### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Create the 3 DataFrames based on the following raw data

In [3]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [4]:
df1 = pd.DataFrame(data=raw_data_1)
df1

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [5]:
df2 = pd.DataFrame(data=raw_data_2)
df2

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [6]:
df3 = pd.DataFrame(data=raw_data_3)
df3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 3. Assign each to a variable called data1, data2, data3

In [7]:
data1 = df1
data1

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [8]:
data2 = df2
data2

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [9]:
data3 = df3
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 4. Join the two dataframes along rows and assign all_data

In [10]:
all_data = data1.merge(data2, how='right')
all_data

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

### Step 5. Join the two dataframes along columns and assing to all_data_col

In [11]:
all_data_col = data1.merge(data3, how='right')
all_data_col

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          5     Ayoung   Atiches       16
5          7        NaN       NaN       14
6          8        NaN       NaN       15
7          9        NaN       NaN        1
8         10        NaN       NaN       61
9         11        NaN       NaN       16

### Step 6. Print data3

In [12]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 7. Merge all_data and data3 along the subject_id value

In [13]:
all_data.merge(data3, on='subject_id')

  subject_id first_name last_name  test_id
0          4      Billy    Bonder       61
1          5      Brian     Black       16
2          7      Bryce     Brice       14
3          8      Betty    Btisan       15

In [14]:
data4 = all_data.merge(data3, how='right')
data4

  subject_id first_name last_name  test_id
0          1        NaN       NaN       51
1          2        NaN       NaN       15
2          3        NaN       NaN       15
3          4      Billy    Bonder       61
4          5      Brian     Black       16
5          7      Bryce     Brice       14
6          8      Betty    Btisan       15
7          9        NaN       NaN        1
8         10        NaN       NaN       61
9         11        NaN       NaN       16

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

In [15]:
data2.merge(data1, on='subject_id', how='inner')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Billy      Bonder        Alice        Aoni
1          5        Brian       Black       Ayoung     Atiches

### Step 9. Merge all values in data1 and data2, with matching records from both sides where available.

In [16]:
data4.merge(data1, on='subject_id', how='outer', indicator=True)

  subject_id first_name_x last_name_x  ...  first_name_y last_name_y     _merge
0          1          NaN         NaN  ...          Alex    Anderson       both
1          2          NaN         NaN  ...           Amy    Ackerman       both
2          3          NaN         NaN  ...         Allen         Ali       both
3          4        Billy      Bonder  ...         Alice        Aoni       both
4          5        Brian       Black  ...        Ayoung     Atiches       both
5          7        Bryce       Brice  ...           NaN         NaN  left_only
6          8        Betty      Btisan  ...           NaN         NaN  left_only
7          9          NaN         NaN  ...           NaN         NaN  left_only
8         10          NaN         NaN  ...           NaN         NaN  left_only
9         11          NaN         NaN  ...           NaN         NaN  left_only

[10 rows x 7 columns]